---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWGImportLinkAvailable
source: html/9c83020b-2349-7cb0-c275-cb2bbbc884fc.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDWGImportLinkAvailable Method

Checks whether the DWG Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsDWGImportLinkAvailable()
```

## Returns
True if the DWG Import/Link functionality is available in the installed Revit.

## Remarks
DWG Import/Link is optional functionality that does not have to be part of the Revit installation.